{
  "1": {
    "What types of hospitalization expenses are covered, and what are the limits for room and room expenses?": "Hospitalization expenses covered include medical and surgical treatment in registered hospitals under qualified medical practitioner supervision, with reimbursement for room and nursing expenses provided up to 1% of the sum insured or a maximum of ₹5,000 per day, and ICU expenses also covered; other reimbursable inpatient medical expenses such as surgeon, anesthetist, consultant, specialist fees, anesthesia, medicines, and operation theater charges are included, but overall coverage is limited by the sum insured as specified in the policy.",
    "What is domiciliary hospitalization, and what are its key exclusions?": "Domiciliary hospitalization is defined as coverage for home treatment lasting over three days when hospital admission is not feasible, such as when a patient cannot be transferred due to their condition or if hospital rooms are unavailable; exclusions for domiciliary hospitalization include pre- and post-hospitalization expenses, as well as treatment for conditions like asthma, diabetes, hypertension, and other specific diseases, and coverage is limited as specified in the policy schedule.",
    "What are the benefits and limits of telemedicine and maternity coverage under this policy?": "The policy provides telemedicine benefits that cover digital consultation expenses with registered medical practitioners via telecommunication platforms, with a coverage limit of ₹2,000 per insured family each policy period, while optional maternity coverage is available with an additional 10% premium, granting up to ₹50,000 coverage for the first two children (with a month waiting period) and newborns are covered from day one, all subject to per policy period limits.",
    "What specialized treatments are covered, and what are their sub-limits?": "Specialized treatments covered under the policy include Uterine Artery Embolization with a limit of ₹50,000, Robotic Surgeries with a limit of ₹1,00,000, and Oral Chemotherapy at 25% coverage, as specifically detailed in the sub-limits for these procedures.",
    "What are the waiting periods for pre-existing diseases and specified diseases or procedures?": "The policy requires a 36-month waiting period for pre-existing diseases before coverage applies, and there is a 1-3 year waiting period for specific diseases or procedures such as hernia, cataract, and joint replacement, while a general waiting period of 30 days applies to all non-accident related illnesses before activation.",
    "print n random numbers in js": "The document does not specify."
  }
}