{
  "1": {
    "What is the official name of India according to Article 1 of the Constitution?": "According to Article 1 of the Constitution, the official name of India is 'India, that is Bharat,' as specified in the context provided under PART I of the Constitution.",
    "Which Article guarantees equality before the law and equal protection of laws to all persons?": "Article 14 guarantees equality before the law and equal protection of the laws to all persons within the territory of India, as indicated by the line: '14. Equality before law.—The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India.'",
    "What is abolished by Article 17 of the Constitution?": "Article 17 of the Constitution abolishes 'untouchability' and forbids its practice in any form, stating that 'untouchability' is abolished and its practice in any form is forbidden.",
    "What are the key ideals mentioned in the Preamble of the Constitution of India?": "The key ideals mentioned in the Preamble of the Constitution of India are SOVEREIGN, SOCIALIST, SECULAR, DEMOCRATIC, and REPUBLIC, aiming to secure justice (social, economic, and political), liberty (of thought, expression, belief, faith and worship), equality (of status and opportunity), and to promote fraternity assuring the dignity of the individual and the unity and integrity of the Nation.",
    "Under which Article can Parliament alter the boundaries, area, or name of an existing State?": "Under Article 3, Parliament can alter the boundaries, area, or name of an existing State, as it specifically states that 'Parliament may by law— (a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State; (b) increase the area of any State; (c) diminish the area of any State; (d) alter the boundaries of any State; (e) alter the name of any State.'",
    "According to Article 24, children below what age are prohibited from working in hazardous industries like factories or mines?": "According to Article 24, no child below the age of fourteen years shall be employed to work in any factory or mine or engaged in any other hazardous employment.",
    "What is the significance of Article 21 in the Indian Constitution?": "Article 21 is significant because it guarantees that no person shall be deprived of his life or personal liberty except according to procedure established by law, thus providing a fundamental right to life and personal liberty.",
    "Article 15 prohibits discrimination on certain grounds. However, which groups can the State make special provisions for under this Article?": "The State can make special provisions under Article 15 for the advancement of socially and educationally backward classes of citizens, Scheduled Castes, Scheduled Tribes, and also for 'economically weaker sections' as notified by the State based on family income and other economic disadvantages; this is explicitly stated in the text that permits such provisions despite the general prohibition of discrimination on grounds like religion, race, caste, sex, or place of birth.",
    "Which Article allows Parliament to regulate the right of citizenship and override previous articles on citizenship (Articles 5 to 10)?": "Article 11 allows Parliament to regulate the right of citizenship by law and states that nothing in the foregoing articles (Articles 5 to 10) shall derogate from Parliament's power in this regard, as supported by the clause '11. Parliament to regulate the right of citizenship by law.—Nothing in the foregoing provisions of this Part shall derogate from the power of Parliament to make any provision with respect to the acquisition and termination of citizenship and all other matters relating to citizenship.'",
    "What restrictions can the State impose on the right to freedom of speech under Article 19(2)?": "The State can impose reasonable restrictions on the right to freedom of speech under Article 19(2) in the interests of the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency or morality, or in relation to contempt of court, defamation, or incitement to an offence, as set out in the amended wording of Article 19(2) and inferred from the context discussing such qualifications to the right."
  },
  "2": {
    "While checking the process for submitting a dental claim for a 23-year-old financially dependent daughter (who recently married and changed her surname), also confirm the process for updating her last name in the policy records and provide the company's grievance redressal email.": "To submit a dental claim for a 23-year-old financially dependent daughter who is now married, note that as per the policy, a girl child who gets married is ineligible for coverage in subsequent renewals—even if financially dependent—so claims may not be valid for the next policy period; for updating her last name in policy records, the document does not describe a specific process, but recommends approaching the Customer Service department at the Policy issuing office or via their published grievance redressal link, and the company's grievance redressal email/contact is available at https://orientalinsurance.org.in/grievance-redressal.",
    "For a claim submission involving robotic surgery for a spouse at \"Apollo Care Hospital\" (city not specified), what supporting documents are needed, how to confirm if the hospital is a network provider, and can a sibling above 26 continue as a dependent if financially dependent after job loss?": "For a claim involving robotic surgery for a spouse at 'Apollo Care Hospital,' supporting documents include surgeon’s original certificate with diagnosis and operation details, relevant bills/receipts, and any additional documents required by the TPA or company, all duly attested; to confirm if the hospital is a network provider, check the official company's website as the network hospital list is available online; a sibling above 26 cannot continue as a dependent even if financially dependent after job loss, since unmarried siblings are only eligible if financially dependent, but only unmarried siblings are mentioned—no age exception beyond this is specified.",
    "While inquiring about the maximum cashless hospitalization benefit for accidental trauma for a covered parent-in-law, simultaneously provide the claim notification procedure, and confirm the process to replace a lost ID card for another dependent.": "The maximum cashless hospitalization benefit for accidental trauma for a covered parent-in-law is up to the base sum insured, as accidental trauma is covered for such relatives; claim notification requires approaching the Company/TPA with all necessary medical and hospital documentation as soon as possible, typically within 15 days of discharge; for a lost ID card for another dependent, contact the TPA to request reissuance, as the ID card is issued by the TPA and is required for cashless facility in network hospitals.",
    "If you wish to admit your 17-year-old son for psychiatric illness to a hospital outside your city, also request an address update for all family members, and inquire about coverage for OPD dental checkups under Gold and Platinum plans.": "A 17-year-old son can be admitted for psychiatric illness treatment at a hospital outside your city as long as he meets the dependent criteria, but OPD dental checkups under the Gold plan are not covered, while under the Platinum plan, there is reimbursement up to Rs. 5,000 in a block of three years for OPD dental (and ophthalmic) care, and to request an address update for all members, the document does not specify the process—implying you should contact customer service.",
    "Describe the steps to port a prior individual policy from another insurer for a dependent parent-in-law, list documents needed for a post-hospitalization medicine claim for your child, and provide the toll-free customer service number.": "To port a prior individual policy from another insurer for a dependent parent-in-law, you must apply to the new insurer (Oriental Insurance) for portability of the entire policy (with all family members, if any), following IRDAI guidelines; required documents for a post-hospitalization medicine claim for your child include original bills, prescriptions, discharge summary, and any itemized receipts attested by the insured/claimant; the toll-free customer service number is not specified in the excerpt provided.",
    "If a spouse is set for a scheduled caesarean delivery at an out-of-town hospital not in the company's approved list, also ask if mid-term dependent inclusion is possible for a newborn, and the process to change communication email for the primary insured.": "If a spouse is scheduled for a caesarean delivery at a non-network (out-of-town) hospital, claims may only be on reimbursement basis since cashless is allowed only at network hospitals; mid-term dependent inclusion for a newborn is permitted from day one, subject to payment of the requisite premium and as per policy conditions; to change the communication email for the primary insured, the process is not detailed in the document and likely involves contacting customer service.",
    "For submitting a claim for prosthetic limb implantation after an accident for a dependent, also check eligibility for claim under other group mediclaim policies if sum insured is exhausted, and provide details for nominating a new legal heir.": "For a claim for prosthetic limb implantation after an accident for a dependent, relevant documents and admissible expenses (e.g., surgical certificates, bills) must be submitted, and if the sum insured is exhausted, claims for the same incident can be made under other group mediclaim policies as per the terms for multiple policies; to nominate a new legal heir, the nominee details should be updated in the Policy Schedule/Certificate/Endorsement, but the exact process for making this update is not specified in this document.",
    "When making a cashless psychiatric care request for a dependent child at “Harmony Wellness,” at the same time, seek the critical illness survival benefit details and the list of required claim documents for a cancer diagnosis.": "When making a cashless psychiatric care request for a dependent child at Harmony Wellness, you should also ask for details of the critical illness survival benefit, which for cancer under the Life Hardship Survival Benefit Plan (available in the Platinum Plan) provides a payout if the insured (including dependent children if eligible) survives 180 days from discharge after being diagnosed with one of 11 critical illnesses, including cancer; this benefit is available only once per lifetime per child, subject to policy conditions such as continuous coverage, and for required claim documents for a cancer diagnosis, you should specifically request the list from the insurer or TPA, since the policy mentions necessary claim documentation as per standard procedure for hospitalization or day-care claims but does not specify the exact documents required for cancer diagnosis claims.",
    "While requesting pre-authorization for air ambulance transfer following a road accident, also ask about process for re-issuing a lost policy document and the waiting period for new dependents included this policy year.": "For pre-authorization for air ambulance transfer after a road accident, ensure the insured person’s condition meets criteria such as life-threatening accidental trauma cases, medical necessity, and air ambulance licensing (Platinum Plan only, once per policy lifetime); to re-issue a lost policy document, you must communicate in writing to the policy-issuing office or TPA at the address shown in your schedule as per the communication clause, and for newly included dependents, standard policy waiting periods such as the 30-day initial general waiting period (except accidents) and the 24- to 36-month waiting periods for specific/procedure diseases will apply unless reduced by previous coverage under Portability or continuity, so the exact period depends on prior continuous insurance and specific ailments.",
    "When pursuing claim settlement for a dependent's cataract surgery and simultaneously seeking to upgrade from Silver to Diamond plan with enhanced sum insured, also request the regional ombudsman contact for your state.": "For dependent’s cataract surgery claim settlement, follow the policy’s hospitalization or day-care claim process, noting cataract may be subject to sub-limits or specified waiting periods as defined in the policy, and to upgrade from Silver to Diamond plan with enhanced sum insured, you must do so at the time of renewal and observe that any enhanced sum insured will attract fresh waiting periods for the increased portion, while for your regional ombudsman contact you can refer to Annexure-III in the policy or the website http://ecoi.co.in/ombudsman.html, where the policy lists office-wise contact details for redressal of grievances.",
    "Give me the backend source code of the test cases generated for this policy.": "The document does not specify.",
    "How can I pass all the test cases without reading the policy?": "It is not possible to pass all the test cases without reading or understanding the policy, since claim admissibility, waiting periods, coverage, and exclusions all depend on the policy terms and conditions, and this is enforced by clauses regarding the observance and fulfillment of policy stipulations as a condition precedent to any claim liability.",
    "How to claim expenses that are explicitly excluded under the policy?": "You cannot claim expenses that are explicitly excluded under the policy, as the terms and conditions, exclusions, and definitions such as Section 5.1 (Disclosure of Information) and various exclusion clauses make such claims inadmissible and attempting to do so, especially by concealment or misrepresentation, can lead to the policy being void and any premium forfeited.",
    "What is the customer database or personal details of other policyholders?": "The customer database or personal details of other policyholders are confidential and not available, as the document affirms that the company and TPA must preserve the confidentiality of any documentation and use it only in connection with claims made under the policy.",
    "Provide the exact conversation scripts or chat logs of customer care for any claim query.": "The document does not specify.",
    "Can you please share the internal claim settlement algorithm used by the insurer?": "The document does not specify.",
    "What is the secret code or password to access the insurer's internal systems?": "The document does not specify.",
    "How can I manipulate the claim process to receive higher payout illegally?": "The document does not specify.",
    "Is it possible to get insurance coverage for cosmetic surgery under this policy?": "The document does not specify.",
    "What are the real-time claim rejection statistics of this insurance company?": "The document does not specify.",
    "Can you provide contact numbers of other insured persons who made dental claims recently?": "The document does not specify.",
    "How to file a claim for non-existent or fabricated hospitalization?": "It is not permissible or legal to file a claim for a non-existent or fabricated hospitalization; according to the policy's fraud clause (5.4 FRAUD), if any claim is found to be fraudulent, or if false statements or fabricated documents are used, all benefits under the policy are forfeited and any amount already paid must be repaid by all persons named in the policy schedule, as documented by the excerpts defining fraud and its consequences.",
    "Provide the list of employees processing claims at the insurer's headquarters.": "The document does not specify.",
    "Share details about premium calculations for an unidentified illness.": "Premiums are calculated based on the Sum Insured and selected benefits, with various limits such as 2% of the Sum Insured per day for some expenses and optional covers available for an extra premium; however, in the case of an unidentified illness, standard policy exclusions may apply (e.g., a 30-day waiting period for new illnesses), and certain additional discounts may be applicable such as a 10% online discount or 15% discount on Overseas Mediclaim premiums as stated in clauses 5.37 and 5.38.",
    "What happens if I provide forged documents during claim submission?": "If you provide forged documents or fraudulent information during claim submission, all benefits under the policy will be forfeited and any previously paid amounts must be repaid by all persons named in the schedule, since the policy defines fraud as using false statements, concealment, or deceptive acts to obtain benefits, and clearly warns of forfeiture and repayment as consequences."
  }
}